
{
  "Electrostatics": [
    "A charged paint is spread in a very thin uniform layer over the surface of a plastic sphere of diameter 12.0 cm, giving it a charge of -49.0 µC. Find the electric field (i) just inside the paint layer; (ii) just outside the paint layer; (iii) 5.00 cm outside the surface of the paint layer.",
      "What must be the distance between point charge q1 = 26.0 mC and point charge q2 = 47.0 mC for the electrostatic force between them to have a magnitude of 5.70 N? (k = 9 x 10⁹ Nm²/C²). Is the force repulsive or attractive?",  
    "(a) A charged paint is spread in a very thin uniform layer over the surface of a plastic sphere of diameter 12.0 cm, giving it a charge of -49.0 µC. Find the electric field (i) just inside the paint layer; (ii) just outside the paint layer; (iii) 5.00 cm outside the surface of the paint layer. [5] (b) You want to produce an electric field = (0, 4104, 0) N/C. (i) Where would you place a proton to produce this field at the origin? (ii) Instead of a proton, where would you place an electron to produce this field at the origin?",
    "The current density through a cross section varies with radial distance r as J = ar², where a = 3.0 x 10¹¹ A/m² and r is in meters. What is the current through the outer portion of the wire between radial distances R/2 and R?",
    "An electric field 3j + 4k (N/C) is present at a place. What will be the electric flux passing through a square plate of side 2 m if the plate is placed in (i) the y-z plane (ii) perpendicular to the y-z plane?"
  ],


   "Gauss's Law & Symmetry": [
    "Suppose you have a solid sphere of radius R with uniform volume charge density ρ. Find the electric field outside and inside the sphere.",
    "(a) Show the variations of the electric field for a spherical symmetrical charged distribution and a thin shell with respect to distance with the help of graphs only. (Plot must start from the origin, the surface, and the outside the surface of both distributions.) [2] (b) A charge q = -3 C is placed at the center of a cube of side length L. Find the flux through the whole cube. If the cube is changed into a sphere what will happen to the flux? [3] (c) An infinite line of charge produces a field of 4.52 x 10 N/C at a distance of 1.96 m. Calculate the linear charge density. [3] (d) The total flux through a Gaussian surface is zero. (i) What is the net charge enclosed? (ii) Is E = 0 at all points on the surface? Give reason.",
    "A flat sheet of paper of area 0.250 m² is oriented so that the normal to the sheet is at an angle of 60° to a uniform electric field of magnitude 14 N/C. (i) Find the magnitude of the electric flux through the sheet. (ii) Does the answer to part (i) depend on the shape of the sheet? If yes, why? If not, why not? (iii) For what angle between the normal to the sheet and the electric field is the magnitude of the flux through the sheet largest and smallest? Explain your answers. (06) (1) Sketch a graph that shows the variation of the electric field with respect to the distance along the x-axis for a thin, uniformly charged, spherical shell of radius R.",
    "Consider a spherical capacitor formed by two coaxial spheres of radii 'a' and 'b'. Each plate contains a charge of magnitude 'q'. Apply Gauss's law and calculate a mathematical expression of its capacitance. Also, draw its illustration."
  ],
   "Capacitance & Capacitors": [
    "(a) A parallel-plate capacitor consists of two strips of aluminum foil, each with an area of 0.20 m², separated by a distance of 0.10 mm. The space between the foils is empty. The two strips are connected to the terminals of a battery, which produces a potential difference of 200 volts between them. What is the capacitance of this capacitor? What is the electric charge on each plate? What is the strength of the electric field between the plates? (b) Six identical capacitors of capacitance C are connected as shown in the figure below. What is the net capacitance of the combination?",
    "(a) A 100 pF capacitor is charged to a potential difference of 50 V, and the charging battery is disconnected. The capacitor is then connected in parallel with a second (initially uncharged) capacitor. If the potential difference across the first capacitor drops to 35 V, what is the capacitance of this second capacitor?",
    "(a) Does the capacitance C of a capacitor increase, decrease, or remain the same (a) when the charge q on it is doubled and (b) when the potential difference V across it is tripled? Give reason. (02) (b) The plates of a spherical capacitor have radii 38.0 mm and 40.0 mm. (a) Calculate the capacitance. (b) What must be the plate area of a parallel-plate capacitor with the same plate separation and capacitance? (04) (c) When a battery is connected across the capacitor, are the charges on the plates always equal and opposite even for plates of unequal size? Give reasons for your answer. (01) (d) For capacitors charged by the same battery, does the charge stored by the capacitor increase, decrease, or remain the same in each of the following situations? (i) The plate separation of a parallel-plate capacitor is increased. (ii) The radius of the inner cylinder of a cylindrical capacitor is increased. (iii) The radius of the outer spherical shell of a spherical capacitor is increased. (03) (e) How does the presence of a dielectric alter the electric field between the capacitor plates? Explain briefly. (02)"
  ],
"Current & Resistance": [
    "The magnitude J of the current density in a certain lab wire with a circular cross section of radius R = 2.00 mm is given by J = (3.00 × 10⁸)r², with J in amperes per square meter and radial distance r in meters. What is the current through the outer section bounded by r = 0.900R and r = R?",
    "Suppose a current i is flowing through a uniform cylindrical conducting wire. Derive an expression for drift velocity in terms of i, A, n, and e. Here, i is the current, A is the area of cross-section of the cylindrical wire, n is the number of charge carriers per unit volume, and e is the charge on an electron.",
    "For a hypothetical electronic device, the potential difference V (in volts) measured across the device is related to the current i (in mA) by V = 3.55i². (i) Find the resistance when the current is 2.4 mA. (ii) At what value of the current is the resistance equal to 16 Ω?",
    "A small but measurable current of 1.2 × 10⁻¹⁰ A exists in a copper wire whose diameter is 2.5 mm. The number of charge carriers per unit volume is 8.49 × 10²⁸ m⁻³. Assuming the current is uniform, calculate (a) the current density and (b) the electron drift speed.",
    "(a) The current density through a cross section varies with radial distance r as J = ar², where a = 3.0 × 10¹¹ A/m² and r is in meters. What is the current through the outer portion of the wire between radial distances R/2 and R? (b) Derive a formula that shows the relationship between current density and the drift speed of charged particles. Also, draw its illustration."
  ],
 "Magnetic Forces & The Hall Effect": [
    "Derive an expression for the angular frequency of a charged particle rotating in a uniform magnetic field.",
    "A straight, horizontal length of copper wire has a current i = 28 A through it. What are the magnitude and direction of the minimum magnetic field needed to suspend the wire—that is, to balance the gravitational force on it? The linear density (mass per unit length) of the wire is 6 g/m.",
    "A strip of copper carrying a current i is immersed in a magnetic field. A potential, called the 'Hall Potential' (V), is developed with the electric field across the strip of width d and thickness l. Derive a formula for finding the number of charge carriers per unit volume n, representing Hall potential, magnetic field, thickness, and current. Also, draw an illustration of the Hall effect and show the developed potential.",
    "A straight, horizontal length of copper wire has a current i = 28 A through it. What are the magnitude and direction of the minimum magnetic field B needed to suspend the wire—that is, to balance the gravitational force on it? The linear density (mass per unit length) of the wire is 46.6 g/m."
  ],
   "Magnetic Fields from Currents & Ampere's Law": [
    "The long dimension of the rectangular loop in the figure is 400 × 10⁶ m, and the magnetic field strength near the loop has a constant magnitude of 2 mT. Use the mathematical form of Ampere’s law to estimate the total current encircled by the rectangle.",
    "A long solenoid has 100 turns/cm and carries current i. An electron moves within the solenoid in a circle of radius 2.30 cm perpendicular to the solenoid axis. The speed of the electron is a fraction of the speed of light. Find the current in the solenoid.",
    "Apply Ampere's law to find the magnetic field inside a long straight wire carrying current I. Use integration for the Amperian loop. Also, draw an illustration to represent the setup.",
    "The cross section of a long conducting cylinder has an inner radius a = 2.0 cm and outer radius b = 4.0 cm. The cylinder carries a current out of the page, and the magnitude of the current density in the cross section is given by J = cr², where c = 3.0 × 10⁶ A/m⁴ and r is in meters. What is the magnetic field B at the point located at radius r = 3.0 cm from the central axis of the cylinder?"
  ],
   "Oscillations and Waves": [
    "(a) What is the phase constant for the harmonic oscillator with the velocity function v(t) given in Fig-4, if the position function x(t) has the form x = X cos(at + p)? The vertical axis scale is set by vs = 4.0 cm/s. (02) (b) Fig-5 shows the kinetic energy K of a simple harmonic oscillator versus its position x. The vertical axis scale is set by Ks = 4.0 J. What is the spring constant? (02) (c) What is damped oscillation, and how does it differ from undamped oscillation? Describe a real-world scenario where damped oscillations occur. (02) (d) The acceleration a(t) of a particle undergoing SHM is graphed in Fig-6. Which of the labeled points corresponds to the particle at -Xm? (ii) At point 4, is the velocity of the particle positive, negative, or zero? (iii) At point 5, is the particle at -Xm, at +Xm, at 0, between -Xm and 0, or between 0 and +Xm?",
    "A rescue plane flies at 198 km/h (= 55.0 m/s) and constant height h = 500 m toward a point directly over a victim, where a rescue capsule is to land. (a) What should be the angle p of the pilot's line of sight to the victim when the capsule release is made? Calculate.",
    "A string is driven at a frequency of 5.00 Hz. The amplitude of the motion is 12.0 cm, and the wave speed is 20.0 m/s. Determine the angular frequency and wave number k for this wave, and write an expression for the wave function. (b) Fig-7 shows three waves that are separately sent along a string that is stretched under a certain tension along an x-axis. Rank the waves according to their (a) wavelengths, (b) speeds, and (c) angular frequencies, greatest first. (c) Sketch the interference wave of two identical waves having phase differences (a) θ = 0 and (b) θ = π. Also mention the nature of interference taking place.",
    "(a) Discuss the nature of water waves. [3] (b) The equation of a transverse wave on a string is y = (2.0 mm) sin [(20 mm⁻¹)x - (600 s⁻¹)t]. Calculate (i) wavelength (ii) time period (iii) wave speed (iv) frequency (v) wave number [5] (c) The nature of light waves is transverse but they are not mechanical waves. Give the reason. [3] (d) Two identical sinusoidal waves, moving in the same direction along a stretched string, interfere with each other. The amplitude of each wave is 15 mm. Calculate the amplitudes of the resultant waves due to the interference for phase differences 120° and 180°. Give the types of both interferences."
  ],
  "Vectors": [
    "Suppose that A = i cos(ωt) + j sin(ωt), where ω is a constant. Find dA/dt (note that i and j behave as constants in differentiation). Show that dA/dt is perpendicular to A.",
    "(a) Find the magnitude of vector C that satisfy the equation 2A - 6B + 3C = 2j, where A = i - 2k and B = -j + k/2. (b) A person walks 57.0 m at 47.0° north of east, turns and walks 72.0 m at 15.0° south of east. How far and at what angle is the person's final position from his/her initial position.",
    "(a) What is the sum of the following four vectors in (i) unit vector notation, and as (ii) a magnitude and (iii) an angle? A = (2.00 m)i + (3.00 m)j, B = 4.00 m at 65.0°, C = (-4.00 m)i + (-6.00 m)j, D = 5.00 m at -235°. (b) Find the angle between the two vectors: A = 3i - 3j + 6k and B = 5i + 6j - 8k."
  ],
   "Motion in 1D & 2D": [
    "A golfer claims that a golf ball launched with an elevation angle of 12° can reach a horizontal range of 250 m. Ignoring air friction, what would the initial speed of such a golf ball have to be? What maximum height would it reach?",
    "(a) The position of an object moving along an x-axis is given by x = 3t - 4t² + t³, where x is in meters and t is in seconds. Find the position of the object at the following values of t: (i) 2 s, (ii) 3 s, (iii) 4 s, (iv) What is the object's displacement between t = 2 s and t = 4 s? (v) What is the average velocity for the time interval from t = 2 s to 4 s? [5] (b) With what speed must a ball be thrown vertically from ground level to rise to a maximum height of 50 m? How long will it be in air? Sketch graphs of y, v, and a versus t for the ball. On the first two graphs, indicate the time at which 50 m is reached.",
    "(a) With the help of the following velocity-time graph (Fig-1), draw the acceleration versus time graphs. (b) A turtle crawls along a straight line, which we will call the x-axis with positive direction to the right. The equation for the turtle's position as a function of time is x(t) = 50 + 2t - 0.0625t². Find the turtle’s initial velocity, initial position, and initial acceleration. At what time t is the velocity of the turtle zero?"
  ]
}

