{
  "Assembly Language Fundamentals": [
      "(i) Which of the following bus is unidirectional? a. Data Bus b. Address Bus c. Control Bus (ii) Which of the following instruction can change the value of IP register? a. Mov b. Call c. push (iii) Which of the following instruction does not change the flag register? a. cli b. std c. jc",
      "a. How do assemblers and linkers work together? b. How many bytes are allocated as a result of the following data definition directive: X1 BYTE 20 DUP(30 DUP('COAL')) c. Differentiate between the following Assembly Language instructions: MOV EBX, OFFSET X1 MOV EBX, X1 d. Elaborate the difference between MOVZX and MOVSX instructions through an example. e. Consider the following code. What is the value of AX after execution of the following instructions? MOV AX, 10H MOV CX, 0AH L1: INC AX DEC CX LOOPNE L1",
      "a. Consider the following code snippet. What is the value of AX after execution of the following instructions? MOV AX, 90F8h MOV CX, 08h L1: SHRD AX, CX, 1 JC L2 LOOP L1 L2: RET b. Elaborate the difference between RCR and ROR with the help of working example. c. Write equivalent x86 assembly instructions for the following operation: POP EBX d. When does RECURSION is preferred over LOOPING? Give some real world example. e. Write the x86 assembly PROTOYPE for following sample function: void sample(int length, char ch, int arr[]); f. What will happen, if immediately upon entering a subroutine you execute a 'POP' instruction? g. Write a single x86 instruction to replace each of the following two instructions: LEA EBX, X1",
      "a. When do you typically use the CBW and CWD instructions? b. Assume a four-byte x86 machine code as B9 C5 12 00. How would you determine the size of register used in this instruction? Explain c. What are the key benefits of RISC architecture (like MIPS)? d. Explain the execution steps of MIPS instruction BNEQ $t0, $t1, L1. Assuming L1 as a valid label",
      "a. What are the two ways of passing arguments to a procedure? b. When does a divide overflow occur at machine level? Give an example to illustrate. c. Illustrates the steps taken by the CPU when the INT instruction is invoked by a program: d. How CLD and STD instructions are used with the string primitive instruction? e. Is it possible for a NEG instruction to set the Overflow flag? Explain in one sentence. f. If, immediately upon entering a subroutine, you execute a 'POP EAX' instruction, what value will you have in the EAX register? g. Differentiate between RET and RET 8 instructions. h. How do you declare a two-dimensional 4x4 array of bytes in assembly language? Give the code."

  ],
 "Procedures and Stack": [
    "Assume you have an array of characters of 50 elements. You need to capitalize the first character of each word after a space and also count the number of words in the string. Write a procedure to pass this array by reference and implement the logic.",
    "Suppose you have a dataset of Corona cases reported in Pakistan, which includes total number of infected people, number of deaths, people recovered, inf_male, inf_female, rec_male, rec_female for the last 30 days. Each day records only that day's information. Write a macro/procedure to find: (a) Calculate the number of cases recovered in terms of male & female of a day. Male_recovered = rec_male / people recovered, Female_recovered = rec_female / people recovered. (b) Calculate the number of infected cases in terms of male & female of a day. Male_infected = inf_male / infected people, Female_infected = inf_female / infected people. (c) Accumulate the total number of infected cases, number of deaths, people recovered in the last 30 days.",
    "Implement the following pseudo-code in an x86 assembly program. Your program must maintain and clean the stack used for this program; don’t use ENTER/LEAVE instructions and LOCAL directive. int array[] = {10, 60, 20, 33, 72, 89, 45, 65, 72, 18}; int sample = 50; void main(){ int sum = 0; int index = 0; func1(index, &sum); } void func1(int i, int* s) { int arraySize = sizeof array / sizeof sample; while(i < arraySize) { if (array[i] <= sample) { *s += array[i]; } i++; } }",
    "Write an Assembly Language Program having a procedure CAPITALCASE to find all capital letters in a string and store only Capital Case Letters in a DWORD array CCASE. In this problem, you are supposed to use recursion performed through stack frames discussed in the class. For example, if the INPUT string passed is: FAST National University, Karachi, the Expected Output will be: FAST NUK.",
    "Write a procedure that receives a string through the stack (i.e., the string pointer is passed to the procedure) and removes all leading and duplicate blank characters in the string. For example, if the input string passed is: 'UUUUUReadingu u LAssemblyuu u u ulanguage', it will be modified by removing all leading and duplicate blanks as: 'ReadingLuAeemblyLuLanguage'."
  ],
 "String and Array": [
    "Declare and initialize an array with your (Actual) ID and Name stored in it. Use a loop with indexed addressing to swap the elements of the array by half. Do not copy the elements to any other array. In the end, display the elements from the array. Hint: Use SIZEOF, TYPE, and LENGTHOF operators to make the program flexible. Example (use your own ID & name): 1 9 k - 1 2 3 4 A Z A M K H A N. Expected Output: N A H K M A Z A 1 2 3 4 - k 9 1.",
    "Assume you have an array of characters of 50 elements. You need to capitalize the first character of each word after a space and also count the number of words in the string. Write a procedure to pass this array by reference and implement the logic.",
    "Given that EBX points to the following array ewords, write an x86 code snippet to process this array and print the starting offset of each word starting with letter e or E. ewords byte “The eagle eyed snake eagerly attacked Easter eggs”, 0.",
    "Write an assembly language program to read a string of characters from the user and print/store the vowel count. For each vowel, the count includes both uppercase and lowercase letters. Example: For input 'Advanced Programming produces in UNIX Environment', the output should be: a/A = 3, e/E = 3, i/I = 4, o/O = 2, u/U = 1.",
    "Write an x86 assembly program that finds and stores all common characters between two strings Source and Destination into a Result array. Use string instructions (LODSB, SCASB, REPNE) in your solution."
  ],
 "Shift/Rotate Operations": [
    "Give the value of AL and BL after execution of these instructions: mov al, 0D4h; rcl al, 1; stc; mov bl, 0D4h; rcr bl, 3.",
    "Consider the following code snippet. What is the value of AX after execution of the instructions? MOV AX, 90F8h; MOV CX, 08h; L1: SHRD AX, CX, 1; JC L2; LOOP L1; L2: RET.",
    "Data transmission and file systems often use parity for error detection. Given a signed 32-bit integer, write a program to read the integer (positive or negative) and determine whether its binary representation contains an odd or even number of 1-bits. Also print the total number of 1s.",
    "Find the value of AL after each of the following sequences: MOV AL,0D4H; SHL AL,3 (a). MOV AL,0E4H; SAR AL,3 (b). STC; MOV AL,0ABH; ROL AL,27 (c). STC; MOV AL,10H; RCR AL,1 (d)."
  ],
  "Machine Code Encoding / Decoding":[
   "Encode the following x86 assembly instructions: (i) CMP BX, [BP+08h] → 3B 01 011 110 <- 08; (ii) MOV [BX+4099h], 4F87h → C7 10 000 111 <- 99 40 <- 87 4F; (iii) SUB BX, 7E90h → 81 + 03 <- 90 7E; (iv) INC WORD PTR [SI+2A6h] → FF 10 000 100 <- A6 02.",
    "Convert the following assembly instructions to machine language in hexadecimal: (i) PUSH BX; (ii) MOV AX, CX; (iii) MOV [BX][DI] + 4567h, DX; (iv) LOOP L1 with displacement = 40h.",
    "Convert the following hex machine codes into assembly mnemonics and describe the meaning of each byte field: (i) B8 12 20h; (ii) 52h; (iii) 03 04h.",
    "Convert the following assembly instructions to machine codes: I. MOVZX CX, VAR1 (Var1 = 18h); II. POP 0F12C [BX]; III. MOV BX, DX; IV. INC [BP][DI] + 2C; V. RCL [BX], 3."
  ]
}

