{
"Essay Writing": [
  "1) Pick one topic sentence and write a persuasive essay supporting your view:\n   - Expensive weddings are an obscene waste of money.\n   - Occasional arguments are good for friendship.",
  "2) Write a persuasive essay on any ONE of the following:\n   a) Parks should be constructed in every neighborhood vs. parks occupy too much land.\n   b) Old buildings should be preserved as part of history vs. old buildings should be demolished for new constructions.",
  "3) Write a problem-solution essay on any ONE of the following:\n   a) Strategies to make online shopping a rewarding experience.\n   b) Strategies to help students choose the right career/field after joining university.",
  "4) Write a comparison and contrast essay on any ONE of the following:\n   a) Facebook vs. Instagram.\n   b) Role of Parents vs. Teachers in one's success.",
  "5) Write a persuasive essay on any ONE of the following:\n   a) Mental health awareness should be compulsory in school curriculum.\n   b) Funding priority: science/engineering vs. other subjects for national development in the digital age.",
  "6) Write a problem-solution essay on any ONE of the following:\n   a) Strategies for effective personal financial management.\n   b) Solutions to mitigate Karachi's traffic problems for smoother mobility and efficient urban transport."
],

"Fragments & Run-ons": [
  "A) Read the following and write 'F' for fragments and 'W' for well-formed sentences:\n1. Our instructor seems strict but is actually friendly and helpful. (W)\n2. As technological progress is the basis for competitiveness and advancement in the aerospace industry. (F)\n3. Hoping to win the concert tickets and please his friends. (F)\n4. Science is learning more and more about the versatility of form in dinosaurs with each great find in China, the Americas, Antarctica, and elsewhere. (W)\n5. As flooding and other natural disasters become more common because of climate change. (F)\n6. The number and intensity of extreme weather events, such as drought and tropical cyclones (hurricanes and typhoons). (F)\n7. The origin of the Moon was long a mystery, and, beginning in the 19th century, three competing theories emerged to solve it. (W)\n8. As proof, 12% public schools in the 1999-2000 school year, 20% public and private schools in the 2017-18 school year, 23% public and private schools in the 2020-2021 school year. (F)",
  "B) Correct the fragments in the following paragraphs (each paragraph contains 2 fragments):\n1. Corrected Paragraph: In the heart of the bustling city, surrounded by skyscrapers and crowded streets, this café served a variety of artisanal coffees and homemade pastries. With comfortable seating and soft jazz music in the background, it was the perfect spot to unwind after a hectic day.\n2. Corrected Paragraph: After the long and tiring journey through dense forests and treacherous terrain, the explorers finally reached the summit of the mountain. Sweating and exhausted, they enjoyed the breathtaking view from the top, making the arduous climb worthwhile.",
  "C) Identify and correct fragments in short passages:\n1. Corrected: My phone rang at least ten times this morning and then was silent the rest of the day. I finally called the telephone company to see if my phone was out of order.\n2. Corrected: Although hot dogs, French fries, and rich ice cream are not healthy foods, they're still favorites for many Americans. People are determined to enjoy themselves and don't want to hear about fat and cholesterol.\n3. Corrected: Sarita boasts that she can read a book in one evening, but she doesn't read the whole book. For example, she reads a chapter here and a page there, missing a lot of the book's detail because she skips parts that she thinks won't interest her.\n4. Corrected: Many people have poor telephone manners, such as beginning all of their conversations by saying, 'Who's this?' Some people don't ask if their call has come at a convenient time or identify themselves when calling.\n5. Corrected: Because members of a youth group in Finland once felt that Donald Duck was immoral, they tried to have Donald Duck cartoons banned from their town. They objected to the fact that Donald had been keeping company with Daisy Duck for more than fifty years without ever getting married.\n6. Corrected: Itching for several days, mosquito bites are one of the little miseries of summer. The itch is the result of the mosquito's saliva, which produces a mild allergic reaction in most people.\n7. Corrected: Although soccer is much more popular in other countries, it has enjoyed a rebirth in the United States in the past ten years. It has become the second most popular sport for those between the ages of 12 and 24."
],
"Paragraph Unity and Coherence": [
  "First Essay: Compare and Contrast – Washington, DC and London\n1. Organizational pattern: a. Subject by Subject\n2. Sentence in body paragraph 1 that does not add to paragraph unity: 7) New York City comprises 5 boroughs sitting where the Hudson River meets the Atlantic Ocean.\n3. Sentence in body paragraph 2 that does not add to paragraph unity: 4) The Thyssen-Bornemisza National Museum in Madrid houses pieces by Rembrandt Harmenszoon van Rijn, Henri Matisse, and many more.\n4. Points of comparison in paragraph 2: b. Art and entertainment\n5. Best connector for sentence 6 in first body paragraph: b. However\n6. Best connector for sentence 6 in third body paragraph: a. Nevertheless\n7. Best supporting point for sentence 2 in third body paragraph: b. A downtown one-bedroom apartment in DC can easily cost $1,800 per month, and a similar 'flat' in London may cost double that amount while the other utilities and essentials in both the cities can cost up to $11,000.\n8. Best supporting point for sentence 6 in third body paragraph: a. In 2009, according to the US Census, 55 percent of DC residents were classified as 'Black or African American' and 35 percent of its residents were classified as 'white.'\n9. Four points of comparison used by the writer: History, Art and culture, Theater and entertainment, Cost of living and socioeconomic disparity\n10. Suggested title: 'Comparing Capitals: Washington, DC and London'",
  "Second Paragraph Exercise: Face-to-Face vs Online Communication\na. Topic sentence: 1) Despite the widespread use of social media, face-to-face communication remains a crucial aspect of interpersonal connections.\nb. Suitable sentence to fill in the blank: iii. On the contrary, virtual conversations lack the richness of real-life encounters.\nc. Sentence providing personal example: 5) For example, recently, during a face-to-face conversation with a friend who was going through a difficult time, I could discern the subtle sadness in his eyes and the sincerity in the voice, allowing me to offer genuine support and strengthen our bond in a way that text messages or online communication could not achieve.\nd. Sentence that introduces an irrelevant detail: 7) Furthermore, social media platforms offer various communication tools."
],
"Transitions and Connectors": [
  "First Exercise: Fill in the blanks with connectors\n1. Therefore\n2. In addition\n3. Furthermore\n4. Thus\n5. Meanwhile",
  "Second Exercise: Insert suitable transitions in the passage\n1. However\n2. Firstly\n3. For example\n4. Finally\n5. To sum up\n6. Although"
],
"Grammar Modifier Parallelism": [
  "Part 1: Identify and correct Misplaced or Dangling Modifiers\n1. Misplaced - Correct: Expecting confusion, we made our plans.\n2. Misplaced - Correct: I showed my cat with the fleas to the veterinarian.\n3. Misplaced - Correct: This typewriter with a wide carriage is used by a staff member.\n4. Misplaced - Correct: Swimming out into the sea, I noticed the current grew stronger.\n5. Dangling - Correct: I hardly ate any food at the banquet dinner.\n6. Dangling - Correct: Walking along the shore, I saw a cruise ship suddenly appear.",
  "Part 2: Correct faulty parallelism\n1. Would you prefer the graceful owl, the rat, or the sneaky cat as your pet?\n2. The difference between rural and country living is in the height of the buildings and the population density.\n3. Stress makes it difficult to exercise regularly, maintain stable relationships, and eat healthy food.",
  "Part 3: Correct verb or pronoun usage\n1. Anyone who wants to go to college can put together a plan that he or she will hold to until the goal is accomplished.\n2. Raul reclined in the lawn chair, opened his magazine wide, and promptly fell sound asleep in the sun.\n3. The neighborhood church serves its community with joy and enthusiasm.\n4. When you answer the question, be sure to select the person who had the greatest impact with his or her intellectual contributions.\n5. This kind of heat can impact a person’s ability to think as he or she tries to do homework.\n6. I took a deep breath and opened the door; there stood a well-dressed man with a large box.",
  "Part 4: Subject-Verb Agreement\n1. has\n2. have\n3. are\n4. do\n5. hopes\n6. seems"
]

}
