{

 "DMA": [
  "There is a famous Conjecture in mathematics that says that every even integer greater than 2 has the property that it is the sum of two prime numbers (at least 1 pair, there can be more than 1). For example, for the even number 8, the Goldbach pair is (3, 5) because 3 + 5 = 8. For 12, the Goldbach pair is (5, 7) because 5 + 7 = 12. Similarly, for 28, one Goldbach pair is (5, 23) because 5 + 23 = 28, and also (11, 17) because 11 + 17 = 28. Computers have been used extensively to test this conjecture, and no counterexample has been found to disprove it till date. Implement the function below that finds all Goldbach pairs for all the even numbers passed as pointer arguments. The function returns a pointer to a 2D array containing pairs of Goldbach pairs for the integers at even_numbers, with the last pair being (-1, -1). Function: int** goldbach_pairs(int* even_numbers, int n); Use this function in a C program that takes even numbers from the user until -1 is entered. Then print all pairs returned through the memory location. Input Sample: 8 12 28 50 -1 Output Sample: (3, 5) (5, 7) (5, 23) (11, 17) (7, 43) (13, 37) (19, 31) (-1, -1)",
  "Generate a 2D array with dimensions M×N using dynamically allocated memory. The user keeps entering rows of the matrix until he/she types '-1'. The number of columns will be given in the first line. Your task is to allocate a new 2D array of dimensions (M-2)×(N-2), where result[i][j] = sum of the 3×3 matrix centered at (i+1, j+1). Example Input: 4 1234 5678 1234 5678 9874 -1 Example Output: Resultant matrix dimension = 2×4 30 39 42 51 30 39 48 49",
  "Write a C program that takes a list of positive integers from the user until -1 is entered. For each positive integer, compute its Collatz Conjecture sequence and print it. Implement the function: int* collatzSequence(int input); The function receives a positive integer and returns a pointer that stores the Collatz sequence for that number, ending with 1. Input Sample: 20 13 40 -1 Output Sample: 20 -> 10 -> 5 -> 16 -> 8 -> 4 -> 2 -> 1 13 -> 40 -> 20 -> 10 -> 5 -> 16 -> 8 -> 4 -> 2 -> 1 40 -> 20 -> 10 -> 5 -> 16 -> 8 -> 4 -> 2 -> 1 The Collatz function applies repeatedly: if n is even, n = n/2; if n is odd, n = 3n + 1; until n reaches 1.",
  "Write a program containing a function that uses array-to-pointer notation to merge the contents of two sorted (ascending order) arrays of type double, storing the result in an output array parameter (still in ascending order). The function should not assume that both input arrays are the same length but should ensure that neither array contains duplicate values. The resulting array should also contain no duplicate values.",
    "Dynamic Array Resizing & Pointer Arithmetic – Weather Tracking: You are building a small weather logging system. The user keeps entering temperature values (integers). You must store all values in a dynamically allocated array using malloc() initially and then realloc() whenever needed. Rules: Start with capacity = 2. Every time array becomes full, double its size using realloc(). Stop when the user enters -1000. After termination: Print the entire array using ONLY pointer arithmetic. Print the maximum and minimum temperature using pointer traversal. Input Example: 20 25 18 33 30 28 -1000 Output Example: Stored: 20 25 18 33 30 28 Max = 33, Min = 18 Final capacity used = 8",
    "Create a 2D Matrix Using Double Pointers – Heatmap Smoothing: Ask the user for rows (R) and columns (C). Dynamically create a 2D matrix using a double pointer int **mat. Then create a smoothed matrix of the same size (also DMA), where: new[i][j] = (mat[i][j] + mat[i][j-1] + mat[i][j+1]) / 3 (Only average left, current, right. Skip boundaries.) Output: Print both matrices using pointer notation: *(*(mat + i) + j).",
    "Pointer-Based Prefix Sum Array (Dynamic Memory Only): User enters a positive integer N, and then N integers. Dynamically allocate: original array, prefix-sum array. Prefix sum logic: prefix[i] = prefix[i-1] + arr[i]; prefix[0] = arr[0]; Requirements: Must use ONLY pointers (*(arr+i) style). Print prefix array without using array indexing. Example: Input: 5 2 4 1 7 3 Output: Prefix: 2 6 7 14 17",
    "Memory Cleanup Simulator – Track Allocated Blocks: Write a program that simulates memory block allocation. User enters sizes of blocks: 10 5 12 8 -1 For each positive size: allocate memory using malloc(size * sizeof(int)), store pointer in a pointer-array (int **blocks), increase pointer-array using realloc() if needed. After input: print addresses of all allocated blocks, then free them in reverse order, after each free, print: Block X freed at address Y. Goal: test memory tracking using pointers to pointers (double pointers).",
    "Pointer Swap Without Temp – Dynamic Array Rotation: User enters N, then a dynamic array of N integers. Rotate the array one step right using ONLY pointer manipulation, and WITHOUT using a temp variable. Hint: Use arithmetic trick: a = a + b; b = a - b; a = a - b; Example: Input: 5 10 20 30 40 50 Output: 50 10 20 30 40",
    "Rotate a Dynamic 1D Array (Using Only Pointers): Write a C program that: Creates a dynamic array of size N (input by user). Fills it with user input. User enters K (number of rotations). Right-rotate the array K times using pointer manipulation only (no indexing like arr[i]). Print the final rotated array. Example: Input: 1 2 3 4 5 and K = 2 Output: 4 5 1 2 3",
    "Create a Dynamic Pascal Triangle (Pointer-Only Implementation): Write a C program that: Takes input N, the number of rows. Dynamically allocate memory for a jagged 2D array (each row has different length). Fill the Pascal triangle values: First and last element of each row = 1, Middle values = sum of two numbers from previous row. Print the triangle. Rules: Must use malloc() for each row separately. Access elements using pointer arithmetic only (e.g., *(*(arr+r) + c))",
    "Dynamic Prime Index Extraction: Given a dynamic array of length N, containing random integers: Create another dynamic array containing ONLY the elements located at prime-numbered indexes (e.g., index 2, 3, 5, 7, 11, ...). Example: Input array: [9, 4, 8, 6, 1, 7, 3, 0] Prime indexes: 2, 3, 5, 7 Output array: [8, 6, 7, 0] Rules: Both arrays must be dynamically allocated. Only pointer arithmetic allowed.",
    "Dynamic Matrix Border Sum (With Shrinking Allocation): Write a program that: Reads a matrix size R × C. Dynamically allocates a 2D array using double pointers (int**). Calculates the border sum (sum of first row, last row, first column, last column). Then create a shrunk matrix by removing the border (new size = (R-2) × (C-2)). Copy only the inner values into the new matrix. Print both the border sum and the new matrix. Rules: Must allocate both matrices dynamically. No static arrays.",
    "Goldbach Pairs Using Pointers and Dynamic Memory Allocation: Problem Description: There is a famous conjecture in mathematics called the Goldbach Conjecture: Every even integer greater than 2 can be expressed as the sum of two prime numbers. Your task is to implement a C program that: Takes input from the user: a list of even numbers. Input continues until -1 is entered. Finds all Goldbach pairs for each entered even number using pointers and dynamic memory allocation. Stores the result in a dynamically allocated 2D array of integers. Ends the result array with a sentinel pair (-1, -1) to indicate the end. Prints all Goldbach pairs returned through the dynamically allocated array. Function Prototype: int** goldbach_pairs(int* even_numbers, int n); even_numbers → pointer to an array containing the input even numbers. n → number of even numbers entered. Returns: pointer to a dynamically allocated 2D array containing all Goldbach pairs. Input Example: 8 12 28 50 -1 Output Example: (3, 5) (5, 7) (5, 23) (11, 17) (7, 43) (13, 37) (19, 31) (-1, -1)",
    "Dynamic 2D Matrix Sum of 3×3 Blocks: Problem Description: You are asked to write a C program that: Dynamically allocates a 2D array to store a matrix of integers. The number of columns N is given by the user first, followed by the matrix rows. The user keeps entering rows of the matrix until they type -1 to stop input. The total number of rows M is unknown beforehand. After reading the matrix, create a new dynamically allocated 2D array of dimensions (M-2) × (N-2). Each element of the new array should be the sum of the 3×3 block centered at the corresponding position in the original matrix. Example: Input: Number of columns: 4 Matrix rows: 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 -1 Output: Resultant matrix dimension: 2 x 2 Sum matrix: 36 45 33 39"

],
"Structures": [
  "Define a structure 'Point' with members x and y representing the coordinates of a point in a 2D plane. Define another structure 'Line' with members start and end, each of type Point, representing the start and end points of a line segment. Now define structures for Circle, Triangle, and Parallelogram. Your program must take input from the user (as shown in the example) and print the details of each shape, including area and perimeter. For a parallelogram, also mention whether it is a rectangle, square, or neither. For a triangle, mention if it is right-angled, isosceles, or equilateral. Hint: Distance between two points = √((x2 - x1)² + (y2 - y1)²), Area of triangle = |x1(y2 - y3) + x2(y3 - y1) + x3(y1 - y2)| / 2. Input Sample: Enter Number of Shapes: 3 Enter Shapes C236 T040454 T006035.2 Output Sample: Shape 1: Circle, Radius: 6 Area: 113.097 square units, Perimeter: 37.699 units Shape 2: Triangle Area: 32 square units, Perimeter: 24 units right-angled: NO, isosceles: NO, equilateral: NO Shape 3: Triangle Area: 15.6 square units, Perimeter: 18 units right-angled: NO, isosceles: YES, equilateral: YES",
  "Create a C program that helps students calculate SGPA and CGPA. The student will provide input via console in the form: course_id, gpa, credit_hours, and semester_number. SGPA is calculated as the sum of (gpa × credit_hours) divided by the sum of credit_hours for a particular semester. CGPA is the same but for all courses. For repeated course_id values, consider the one with the highest GPA for CGPA, and include the credit_hours only once in the total. Use structures to hold information for one course and make an array of this structure to store data for all courses. Input Sample: 101 3.00 3 1 102 2.33 3 1 108 1.33 3 1 108 2.33 3 2 201 3.33 3 2 202 3.67 3 2 Output Sample: Semester 1: 2.47 Semester 2: 2.75 CGPA: 2.71",
  "You are required to implement a Team Record Management System for multiple players, each having the following attributes: Team ID (integer), Name (string, max length 50), Total Wins (int), and Total Losses (int). Your program should implement the following functions: (1) Add a New Team: Append a new team record to the file. (2) Update a Team's Record: Update an existing team's match record by searching with the team ID and incrementing either wins or losses by 1. (3) Read Team Records: Display all teams, the team with the highest wins, and the team with the highest win percentage (wins / total matches), where total matches = wins + losses. Create a menu-driven program that allows the user to add, update, and display team records.",
  "Imagine you are developing a simple text-based RPG game and want to represent different types of game characters using a structure. Each character has specific attributes such as name, health points (HP), attack points (AP), and defense points (DP). To manage this information efficiently, define a structure named 'GameCharacter'. Consider the following restrictions: (a) The sum HP + AP + DP must be exactly 10. (b) HP, AP, and DP must all be between 1 and 5 (inclusive). (c) No two attribute values can be the same. (d) The name length must not exceed 80 characters. Write a C program that defines the GameCharacter structure and allows users to interact with game characters. Implement the following functions: (1) Create Characters: Allow the user to input details for multiple characters until they press the ESC key. (2) Display Characters: Print details of all characters and the total count. (3) Battle Simulation: Simulate a battle where two characters fight. Allow the user to select two characters, adjust health points based on attack and defense, and declare the winner based on remaining health.",
   "Student Performance Analyzer (Structures + Multiple Functions): Create a program that manages the academic record of up to 40 students. Define a structure Student with: roll_no (int), name (string of max 50 chars), quiz[3] (array of 3 quiz marks), mid (float), final (float). Tasks: Write separate functions for: InputData() → takes an array of Student structures and fills all fields. CalculateTotal(Student s) → returns total marks out of 100 total = (quiz1+quiz2+quiz3)/3 * 0.20 + mid0.30 + final0.50 FindTopper() → prints the student with highest total ListBelowAverage() → prints names of students with total < 50 Your program should show a menu and allow the user to repeatedly choose operations.",
    "Hospital Patient Records (Nested Structures + Functions): A hospital keeps details of patients. Define: struct Date { int day, month, year; }; struct Patient { int id; char name[40]; int age; char disease[50]; Date admit_date; Date discharge_date; }; Write functions to: AddPatient() UpdateDischargeDate(patientID) CountDays(Date d1, Date d2) → return number of days between two dates BillCalculation(): Room = 2500 per day If days > 15 → 10% discount If disease == \"ICU\" → daily charges = 5000 Print complete bill report for any selected patient.",
    "Library Management Using Structures & File Functions: Define a structure Book with: id, title, author, price, year, copies_available. Functions you must implement: AddBook() → append to a file SearchBookByTitle() BorrowBook() decrease copies_available by 1 if 0 copies → print \"Not available\" MostExpensiveBook() BooksBeforeYear(int y) → list all books published before year y Program should use a menu and loading/saving must be done using files.",
    "Employee Payroll System (Structures + Calculation Functions): Define: struct Employee { int id; char name[60]; float hours_worked; float hourly_rate; }; Write functions: InputEmployees() GrossSalary(Employee e) → return hours_worked * hourly_rate ApplyBonus(Employee e) If hours > 200 → bonus = 15% If hours > 150 → bonus = 10% Otherwise bonus = 0% FindHighestEarner() → print name & salary ListEmployeesAbove(float salary) → prints employees earning more than given salary",
    "Car Rental Service Management (Structures + Functions + Logic): Define: struct Car { int id; char model[40]; float rent_per_day; int available; // 1 = yes, 0 = no }; struct Customer { int cid; char name[40]; int days; int car_id; }; Write functions to: AddCar() RentCar(Customer c) check availability mark car as unavailable calculate bill if days > 10 → apply 12% discount ReturnCar(car_id) → make it available again ShowAllCars() FindMostRentedModel() (you must maintain a counter for each car)",
    "Hospital Patient Monitoring System: A hospital wants to maintain daily health records of patients admitted in different wards. Define a structure Patient with the following fields: int id, char name[50], float temperature, int oxygenLevel, int wardNumber. Write a program that uses: Function addPatients() Reads data for n patients into an array of Patient structures. Function checkCriticalPatients() Prints all patients who are in critical state. A patient is critical if: temperature > 101 OR oxygenLevel < 90 Function wardReport() Takes a ward number as input and prints: number of patients in that ward, average temperature of that ward, lowest oxygen level in that ward Function updateRecord() Search a patient by ID and allow the user to update temperature and oxygen level. No global variables may be used. Only functions and structure arrays must be used.",
    "Bank Account Management: Define a structure Account with: int accNo, char name[40], float balance, char accType[10] (\"saving\" or \"current\"). Write a program that uses the following: Function createAccounts() Reads data of multiple accounts. Function deposit(Account, int, float)* Deposits money into an account searched by account number. Function withdraw(Account, int, float)* Withdraws money but only if sufficient balance exists (minimum balance = PKR 1000). Function findRichestAccount() Prints account owner with the highest balance. Function displayTypeWise() Prints all savings accounts first, then all current accounts. Sample Format: Input any number of accounts, then perform multiple operations until user chooses Exit.",
    "University Course Registration Records: Define a structure Course with: char courseCode[10], char courseName[50], int creditHours, int capacity, int enrolled. Write functions: loadCourses() Reads n course records. registerStudent() Takes course code + number of students to register. If enrolled + new_students <= capacity, update. Otherwise, print \"Seat limit exceeded\". findCourseWithMaxLoad() Prints the course with the highest enrolled value. displayUnderFilledCourses() Prints all courses where capacity – enrolled > 10. You must use structures + separate functions, no global array allowed.",
    "Weather Station Data Analyzer: A weather station collects daily data for a week. Define a structure DayWeather with: float temperature, float humidity, float windSpeed. Write the following functions: inputWeekData() Stores values for 7 days in an array. averageWeather() Prints the weekly average of temperature, humidity, and windSpeed. findExtremeDays() Day with highest temperature, Day with lowest humidity, Day with highest windSpeed comfortIndex() For each day, calculate index = (temperature * 0.3) + (humidity * 0.4) - (windSpeed * 0.2) Then print: Most comfortable day, Least comfortable day",
    "Library Book Borrowing System: Define a structure Book with: char title[60], char author[40], int year, int totalCopies, int issuedCopies. Write: loadBooks() Reads the list of books. issueBook() Issue a book to a student by title. If issuedCopies < totalCopies, update; otherwise print \"Not Available\". returnBook() Increase issuedCopies after a book is returned. searchByAuthor() Prints all books written by a given author. displayOldBooks() Prints all books older than 20 years. Your program must use arrays of structures and separate functions for each task."
],
"File Handling": [
  "You are developing a C program that performs advanced string manipulations on a text file for a text editor. Implement two functions that perform the following tasks: (1) Longest Words: Identify the three longest strings and surround them with <L> tags, returning an array of these three words. (2) Concatenate Strings: Concatenate all words surrounded with <s> and </s> into one word, remove the <s> tags, and replace them in the text. The program must read from a file named input.txt and write the modified version into output.txt. Print the three longest words on the console. Assume no line exceeds 80 characters. Input File Example: 'Video provides a powerful way to help you prove your point. When you click Online Video, you can paste in the embed code for the video you want to add. You can <s>also type a</s> keyword to search online for the video that best fits your document. To make your document professionally produced, <s>word provides</s> header, footer, cover page, and text box designs that complement.' Output File Example: 'Video <L>provides<L> a powerful way to help you prove your point. When you click Online Video, you can paste in the embed code for the video you want to add. You can alsotypea keyword to search online for the video that best fits your document. To make your document <L>professionally<L> produced, Wordprovides header, footer, cover page, and text box designs that <L>complement<L>.'",
  "Develop a C program that manages product and category information using file operations. The program should include the following functionalities: (1) Add Categories: Allow users to add new categories to categories.txt, each line containing a category name followed by a unique ID (e.g., 'Fruits 1'). (2) Add Products: Allow users to append product data to products.txt, each line containing a product name, its price, and the associated category ID (e.g., 'Apple 2.50 1'). (3) Generate Final Result: The program reads from both products.txt and categories.txt, organizes products by category, and creates an output file named final.txt. Each line in final.txt should display the category name along with its products and prices (e.g., 'Fruits Apple 2.50'). The program should be menu-driven, allowing the user to add categories, add products, or generate final.txt until the user chooses to exit by entering '0'. Example Files: categories.txt → 'Fruits 1', 'Electronics 2'; products.txt → 'Apple 2.50 1', 'Banana 1.20 1', 'TV 500.00 2', 'Laptop 1200.00 2'; final.txt → 'Fruits Apple 2.50', 'Fruits Banana 1.20', 'Electronics TV 500.00', 'Electronics Laptop 1200.00'.",
  "You are developing a C program that performs matrix operations using file handling. Implement two functions: (1) Matrix Multiply: Given two matrices and their dimensions, check for compatibility and compute their product. (2) Sum Matrix: Given two matrices of the same dimensions, compute their sum. The program should read input from a file named input.txt and write both the product and sum (if possible) to output.txt. Also print the results on the console. The first line of input contains the size of the first matrix, followed by its elements, and then the size and elements of the second matrix. Example Input File: '3 3 11 12 13 21 22 23 31 32 33 3 2 41 42 51 52 61 63'. Example Output File: 'Product 1022 1052 1547 1597 2072 2132 Sum Can not be computed'."
],

  "Array, loop, and String": [
    "A weather station stores daily reports for 7 days. Each report is a string in the format: \"DayName Temperature RainOrNot\" Example: \"Monday 32 Yes\" You will be given a 1D array of strings with 7 such reports. Write a C++ program that: Stores the 7 report strings in a 2D character array (each row = one full report). Using loops, extract: Day name, Temperature (number), Rain status (Yes/No). Find and display: The day with the highest temperature, The number of days it rained, All day names that contain the substring \"day\" (case-insensitive). Rewrite all day names in UPPERCASE inside the 2D array. Input example: \"Monday 32 Yes\" \"Tuesday 28 No\" \"Wednesday 30 No\" \"Thursday 33 Yes\" \"Friday 29 No\" \"Saturday 31 Yes\" \"Sunday 27 No\"",
    "You are given the following arrays: string names[] = {\"Ali\",\"Sara\",\"John\",\"Hiba\"}; int quiz1[] = {8, 9, 4, 5}; int quiz2[] = {7, 10, 6, 4}; int quiz3[] = {9, 8, 3, 7}; Write a C++ program using loops + string operations to: Create a 2D array marks[4][3] by merging quiz1, quiz2, quiz3. For each student: Calculate their total score, If name begins with a vowel, convert the full name to UPPERCASE. Display: Name + total score, The student with the lowest total, The student whose name contains the substring \"a\" (case-insensitive). Example output format: ALI → 24 Sara → 27 ... Lowest total score: John Names containing 'a': Ali, Sara",
    "DNA Pattern Finder (Arrays + Strings + Loops): You are given a string containing a DNA sequence, for example: \"ATGCTAGGCTATCG\" And you are also given an array of 3 DNA patterns to search for: \"ATG\" \"GCT\" \"CG\" Write a C++ program that: Stores the main DNA sequence in a character array, Stores the 3 patterns in a 2D char array. Using loops ONLY (no library strstr), find: How many times each pattern appears, The starting index of each appearance. Also create a frequency array of size 26 to count how many times each character A–Z appears in the DNA sequence. Display the pattern with the maximum occurrences.",
    "Movie Ticket Manager (Arrays + Loops + Strings): A cinema stores booking data for 5 customers. Each record is a string: \"Name MovieName Tickets\" Example: \"Ali Avengers 3\" Write a C++ program that: Reads these 5 booking strings into a 2D char array, Extracts (using loops): Customer name, Movie name, Number of tickets (convert char → int). Find and display: The total tickets sold for each unique movie, The customer who bought the most tickets, All customer names that end with a vowel. Finally, create a new 1D string array containing only the movie names without duplicates, using loops. Example input: Ali Avengers 3 Sara Batman 2 John Avengers 4 Hira Joker 1 Omar Batman 3",
    "Sensor Pattern Detection: You are given an array of N sensor readings, where each reading is a string containing only 'H' (high), 'M' (medium), and 'L' (low). Example reading: \"HMLLMH\" A \"stable reading\" is defined as any reading where: It contains at least 2 consecutive 'H', AND It contains no more than 3 total 'L' characters. Write a C++ function that receives the array of readings and returns how many readings are stable. You must use loops and string functions manually (do not use built-in search functions). Function header: int countStableReadings(string arr[], int n);",
    "Student Keyword Mapping: You are given: A 2D char array storing 6 sentences. A string array keywords[3] = {\"pass\", \"fail\", \"repeat\"}. Write a full C++ program that: Reads the given sentences into a local 2D array. Searches each sentence using loops (no strstr()). Stores: sentences containing \"pass\" in Result[0][], sentences containing \"fail\" in Result[1][], sentences containing \"repeat\" in Result[2][], all others in Result[3][]. Finally print the Result array in order. The program should correctly handle multiple matches inside the same sentence.",
    "Inventory Restocking Simulation: A shop tracks stock for 10 items in an integer array stock[10]. Rules: If stock value < 5 → restock by +10. If stock value is between 5 and 20 → restock by +5. If stock value > 20 → reduce by 3 (due to expiry cleanup). Task: Write a C program using loops only that: Reads all 10 stock values. Applies the above rules using a loop. Stores each updated value into a second array updated[10]. Prints both arrays side by side in the format: Old New 3 13 7 12 25 22 ...",
    "Word Pyramid Builder: Write a C++ program using loops (no string library functions except strlen) that: Reads one string from the user. Builds a word-pyramid, where each line prints characters from the start to the current index, but separated by spaces. Example Input: Matrix Expected Output: M M a M a t M a t r M a t r i M a t r i x You must generate the spaces manually using loops.",
    "Student Test Analyzer (1D + Loops): A class has N students. Their marks for 5 quizzes are stored in a 2D array: int marks[100][5]; Write a complete C++ program that: Inputs N. Inputs all marks using loops. Finds and displays: The highest scoring student (sum of 5 quizzes). The lowest scoring quiz overall (quiz index with smallest total). Count how many students scored more than 80 in at least 3 quizzes. Use only arrays + loops. No vectors or STL.",
    "Row Shift Encryption (Arrays + Strings Minimal): You are given a 1D char array representing a message: char msg[100]; Write a program that: Inputs a string (single word, no spaces). Converts every char to uppercase using loops only. Performs a left circular shift of the array R times, where R is user input. Example: msg = \"ABCDE\", R = 2 → Result = \"CDEAB\" Prints the final shifted message. No use of <string> library functions.",
    "Pattern Builder Using a Numeric Array: You are given an array: int arr[] = {3, 6, 9, 12, 15, 18}; int n = 6; Write a program using nested loops that prints the following pattern: 3 3 6 3 6 9 3 6 9 12 3 6 9 12 15 3 6 9 12 15 18 Rules: Outer loop controls number of lines. Inner loop prints the first i elements of the array. No other data structure allowed.",
    "Parking Lot Occupancy Tracker: A parking area has 4 sections, each with 6 parking spots. int park[4][6]; stores: 1 → occupied, 0 → empty. Write a program that: Inputs all values. For each section, print the percentage of occupied spots. Find and print the section with the maximum empty spots. Count how many continuous blocks of 3 empty spots in a row exist in the entire parking lot (search row-wise only). You must use nested loops.",
    "Inventory Restocking Simulation: A store keeps track of 8 products, each with 7 days of stock levels, stored in: int stock[8][7]; A restock happens when a product's stock goes BELOW 20 units on any day. Write a C++ program that: Inputs the stock matrix. Prints the total stock of each product for the whole week. Counts how many total restock events occur in the 8×7 data. For each product, check if the stock for that product was never below 20 for all 7 days. Print those product numbers. No strings allowed except for simple print messages."
  ],
    "Bitwise": [
    "Complex Bit-Packed Student Record System: Create a program in C++ that stores academic details of 12 students in a structure using bit fields only: rollNo: 10 bits, semester: 4 bits, gpaTimes100 (store GPA × 100 as integer): 10 bits, departmentCode: 6 bits. Tasks: Input the data for all 12 students. Sort all entries in ascending order of gpaTimes100. Display the sorted data in a clean table. Finally, pack all student records into a single 64-bit unsigned long long (per student), and display the packed integer for each student in hexadecimal.",
    "Predict the Output of the Program (Bit Parity + Reversal + Masking): Write the exact output of the following C program: #include <stdio.h> unsigned int reverseBits(unsigned int x) { unsigned int r = 0; for (int i = 0; i < 32; i++) { r <<= 1; r |= (x & 1); x >>= 1; } return r; } int parityCheck(unsigned int x) { unsigned int mask = 0x80000000; int count = 0; for (int i = 0; i < 32; i++, x <<= 1) { if (x & mask) count++; } return (count % 2 == 0) ? 1 : 0; } int main() { unsigned int a = 0x00000F3A; unsigned int b = 0xF00000AA; unsigned int revA = reverseBits(a); unsigned int revB = reverseBits(b); printf(\"%u\\n\", revA ^ revB); printf(\"%d\\n\", parityCheck(revA)); printf(\"%d\\n\", parityCheck(revB)); return 0; }",
    "Implement a Branch-Free Population Count Using Bitwise Magic: Write a C++ function (no loops, no branches, no library functions) that counts the number of set bits in a 32-bit unsigned integer using only bitwise arithmetic. Your implementation must use the following required sequence of masks: 0x55555555, 0x33333333, 0x0F0F0F0F, 0x00FF00FF, 0x0000FFFF. Then write a main() function that reads 5 integers from the user and prints the set-bit count for each number.",
    "Advanced Bitwise Cipher with Multi-Step Transformations: Write a program that encrypts a string using the following algorithm for every character: Rotate the character right by 3 bits. Swap bit positions: bits 0 ↔ 7, bits 1 ↔ 6, bits 2 ↔ 5, bits 3 ↔ 4. XOR the resulting byte with a key generated as: key = (index << 2) ^ 0x5F, where index is the position of the character in the string (0-based). Store encrypted bytes in an array and finally display: Encrypted string (ASCII), Hexadecimal representation (space-separated), Binary form of each encrypted byte (8 bits). No built-in bit manipulation or rotation functions may be used.",
    "Bitwise Packed Sensor Data Logger (Multi-Field Extraction): A weather station stores each sensor reading inside a 32-bit unsigned integer with the following bit allocation: Bits 0–9 → Temperature × 10 (0–1023), Bits 10–17 → Humidity percentage (0–100), Bits 18–23 → Wind speed (0–63), Bits 24–31 → Status flags (8 bits: 1 = malfunction, 0 = normal). Tasks: Write C++ functions to: Pack given sensor values into a 32-bit integer. Extract each field back using masks and shifts. Read 8 sensor readings, store them in an array of packed integers. Display all readings in a formatted table sorted by wind speed (descending). Print the raw packed value of each reading in binary (32 bits).",
    "Output Prediction with Nested Bitwise Shifts + XOR Patterns: Predict the exact numerical output of the following program: #include <stdio.h> unsigned int transform(unsigned int x) { x ^= (x << 5); x ^= (x >> 3); x ^= (x << 11); x = (x & 0x0F0F0F0F) | ((x & 0xF0F0F0F0) >> 4); return x; } int main() { unsigned int a = 0x0000ABCD; unsigned int b = 0xF123000F; unsigned int r1 = transform(a); unsigned int r2 = transform(b); printf(\"%u\\n\", r1); printf(\"%u\\n\", r2); printf(\"%u\\n\", (r1 & r2) ^ (r1 | r2)); return 0; }",
    "Implement a 32-bit Rotate-Left Table Generator (No Loops Allowed): Write a C++ function rotateLeft32(unsigned int x, unsigned int n) to rotate a 32-bit integer x to the left by n positions. Restrictions: You may not use loops, conditions, or built-in rotate functions. You must use only bitwise AND, OR, XOR, shifts, and addition. Rotations must wrap around correctly. Then generate and print a table: | Value | Rotate by 1 | Rotate by 5 | Rotate by 13 | Rotate by 31 | for the 10 user-input integers.",
    "Multi-Stage Bit-Level Image Pixel Scrambler: Each pixel in a grayscale image is represented by a 1-byte value. Write a C++ program that takes an array of 20 pixel values and applies the following transformations in order: XOR each pixel with 0xA7. Reverse the bit order (bit 0 ↔ 7 … bit 3 ↔ 4). Rotate the resulting byte left by (pixel_index % 5) positions. Swap the upper nibble and lower nibble. Finally display: The scrambled pixels in decimal, Their hexadecimal forms, A reconstructed array after applying the above operations in reverse order. No library functions may be used for bit reversal or rotation.",
    "Construct a Universal Bit Mask Generator + Checker: Create a program that: Reads an 8-bit pattern from the user (as an integer 0–255). Generates all possible masks that contain exactly the same number of set bits as the input pattern. Store all valid masks in an array. For each mask, perform the following checks using ONLY bitwise operations: Check if the user-input pattern is a subset of the mask. Check if the mask is the bitwise reverse of the pattern. Check if (mask XOR pattern) has even parity. Print each mask in binary and list all the results. You must not use loops inside the bit-manipulation checking functions; only inside main for iterating through masks."
  ]



}

