{
  "Arrays": [
        "(a) A black and white image is stored in a matrix data of dimensions m x n. That is, it has m rows, n columns and n <= 1000. Matrix data contains only 0s and 1s. 0 represents a black pixel and 1 represents white pixel. We are interested in counting the number of k x k blocks (sub-matrices) in data that have at least k^2 / 2 white pixels in them. We call such blocks 'mostly white blocks'. Write a C++ function that returns the count of 'mostly white blocks' in data. You may use the function header: int countMostlyWhite(int data[][1000], int m, int n, int k). For further clarity consider the following example: Here matrix data has dimensions m = 5, n = 4, and let’s take k = 3. Take each 3 x 3 sub-matrix (this example has a total of 6 such matrices), and count its white pixels. Each 'mostly white block' must have at least 9 / 2 = 4 white pixels for k = 3. In the example there are 4 'mostly white blocks' of size 3x3 with their top-left corners at (0,1), (1,1), (2,0), and (2,1) respectively.\nMatrix:\n0 0 1 0\n0 1 0 1\n0 0 0 1\n1 0 1 0\n0 1 1 1",
          "Q7. Write a 'C' program and consider the following two 2D arrays named as CellNameData and CellExpData. The CellNameData array with 4×2 dimension contains the cell no. and cell names, whereas CellExpData array with 5×6 dimension contains the 4 types of gene expression values against each cell name. The first row in both arrays and the first column in CellExpData array are just row and column headers. Out of the 5 different columns in CellExpData array, select only those columns that match with the cell names given in CellNameData array. Store these data into a new 2D array named MergeData. After getting selected columns, expected data in MergeData array are shown below. [Marks 15, 25 minutes]\n[Hint: You can assume numeric values to represent the row and column names. No points will be given for hard-coding except declaration and initialization statements]\nCellNameData:\nCellNo. CellName\n0.1 LiverCell\n0.2 KidneyCell\n0.3 LungCell\nCellExpData:\nGnames LungCell SkinCell IntestineCell LiverCell KidneyCell\nGene1 2.3 1.7 4.3 3.4 4.5\nGene2 1.5 3.6 8.1 5.5 2.9\nGene3 4.1 6.6 5.3 3.9 8.1\nGene4 9.9 2.7 6.2 5.8 3.3\nMergeData:\nLiverCell KidneyCell LungCell\nGene1 3.4 4.5 2.3\nGene2 5.5 2.9 1.5\nGene3 3.9 8.1 4.1\nGene4 5.8 3.3 9.9",
    "During Covid-19 spread, a civil hospital has to manage budget for its 6 departments. Its account manager has to track expense reports department-wise and month-wise from January to May. Write a program using 2D arrays to hold the expense month-wise and department-wise. Requirements:\n(a) Department and month names should be stored and displayed using an array of string pointers.\n(b) Modular programming should be used (input-data, output-data, department-wise-total, month-wise-total) to generate the report.\n(c) The 2D array holding expenses should be passed from main to all functions by reference.\n(d) Calculate and display which department will need federal support (expenses higher than 50,000).\n(e) Display which month was stable in terms of expenses (lowest monthly expense).",
    "A junkyard wants to keep track of how many tons of junk each of its three junk trucks collects each day during a typical week. Write a program that stores this information in a 2D 3×7 array, where each row represents a different junk truck and each column represents a different day of the week. The program should first have the user input the data for each junk truck. Then it should create a report that includes:\n- Average quantity of junk collected per day by all the trucks.\n- The least amount of junk collected during the week by any one truck.\n- The greatest amount of junk collected during the week by any one truck.",
        "Print the output of the following code:\n\ncpp\nvoid UpdateStr(char str[]) {\n    for (int i = 1; str[i] != '\\0'; i++){\n        if (str[i] >= 'a' && str[i] <= 'z' && str[i-1] ==' ')\n            str[i] = str[i] - 32;\n    }\n}\n\nint main() {\n    char str[] = \"I am a student of programming!\";\n    UpdateStr(str);\n    cout << str << endl;\n}"
      ],
  "Loops": [
    "Write the output for this code or error if any:\nint main()\n{\n int i = 0;\n for (i=0; i<20; i++)\n {\n switch(i)\n {\n case 0:\n i += 5;\n case 1:\n i += 2;\n case 5:\n i += 5;\n default:\n i += 4;\n break;\n }\n printf(\"%d \", i);\n }\n return 0;\n}",
    "Write the missing part of the code, as the output is already given. Understand it:\n\nvoid main() {\nint arrAll[]={80, 82, 79, 71, 82, 65, 77};\n for(_______; ______; ________)\n {\n for(_______; ______; ________)\n ____________________\n ____________________\n }\n}\nOutput:\nP\nPR\nPRO\nPROG\nPROGR\nPROGRA\nPROGRAM",
    "Give the output for this:\n#include <stdio.h>\nvoid processNums(int nums[], int n) {\n int i = -1, j;\n for (j=0; j<n; ++j) {\n if (nums[j] == 1) {\n i++;\n int temp = nums[i];\n nums[i] = nums[j];\n nums[j] = temp;\n }\n }\n}\nint main() {\n int arr[] = {0,1,0,0,1,1,0,1,0,0};\n int n = 10;\n for (int i = 0; i < n; i++)\n printf(\"%d \", arr[i]);\n printf(\"\\n\");\n processNums(arr, n);\n for (int i = 0; i < n; i++)\n printf(\"%d \", arr[i]);\n return 0;\n}",
    "Write a C program that reads a string in dynamic array. Then draw the pyramid pattern of a user provided string.\n\nSample Input: Zeshan\n\nSample Output:\nZ\nZ E\nZ E S\nZ E S H\nZ E S H A\nZ E S H A N"
  ],
 "Functions": [
    "Ali has stored prices of all his sold products in a linear 1D dynamic array. Now, he wants you to develop a single function which can calculate sum of all the products on odd indexes and even indexes separately using recursion.",
    "Consider: Two trains are on the same track and they are coming toward each other. The speed of the first train is 50 km/h and the speed of the second train is 70 km/h. A honeybee starts flying between the trains when the distance between two trains is 100 km. The honeybee first flies from first train to second train. Once it reaches the second train, it immediately flies back to the first train … and so on until trains collide. Calculate the total distance travelled by the honeybee. Speed of the honeybee is 80 km/h. Distance formula is given below: Total distance travelled by honeybee = (honeybee speed * distance)/(train_1 speed + train_2 speed). Your task is to solve the problem recursively (direct or indirect).",
    "Mr. Patel family (He, his wife, one son and two daughters) wants to visit northern areas. Mr. Patel went to Faisal Movers Bus service for booking a ticket. He booked 5 seats for his family tour. [30 minutes, 6x3 = 18 Points]\n(a) Create an array of structure called TicketDetails which includes data members— Seat Number, Bus Name, Price, Destination City, and a nested structure which includes person details --- Traveller_ID(CNIC), Traveller Name, Age, and Contact Number.\n(b) Assign the value of each ticket based on the person’s age: if age < 15 or age > 60, ticket price = 4500; otherwise ticket price = 7000.\n(c) Write a function named 'calculate_bill' which calculates the total bill. Apply discounts: >10,000 => 10%, >25,000 => 20%, >50,000 => 30%. Print the receipt with all details.",
    "You are given n jobs and m workers. Each job has a difficulty and a profit, and each worker has an ability representing the maximum difficulty level they can handle. Write a C program to assign jobs to workers to maximize total profit. Function prototype is given with explanation of all arguments and return value. Sample Output: Input: difficulty = [2,4,6,8,10], profit = [10,20,30,40,50], worker = [4,5,6,7] Output: 100. Input: difficulty = [85,47,57], profit = [24,66,99], worker = [40,25,25] Output: 0.",
    "Develop a system for queue management for an exhibition ticketing service for a maximum of 50 people. Each person in queue has a ticket number and name (use Structures). Write four functions: (a) Insert a new person in the queue, (b) Remove a person from the queue, (c) Select a person based on a given name and print data using pointer to structures, (d) Initialize a pointer to function for each of the above functions and call them using these new pointers (all function signatures must be the same)."
],
"Pointers": [
    "Write outputs if the programs are fine or errors if any:\n\nmain()\n{\nchar *arr[] = { \"ant\", \"bat\", \"cat\", \"dog\", \"egg\", \"fly\" };\nfunction(arr);\n}\nvoid function(char **ptr)\n{\nchar *ptr1;\nptr1 = (ptr += sizeof(int))[-2];\nprintf(\"%s\\n\", ptr1);\n}",
    "Ali needs to compile result of two sections together. Develop a system to merge the data from 2 different size arrays into 1 array by passing to a function using pointers. Return the address of the new array and print this new array from Main Function. [6 points]\nFunction prototype: void* MergeArray(const void *Array1, size_t size1, const void *Array2, size_t size2);\nHint: Don’t use any built-in function. Use dynamic memory allocation.",
    "Write a program that will create a structure with N number of student details (Name, Roll# and Percentage) and print the inputted details. Memory to store and print structure should be allocated at run time using malloc() and released using free(). Hint: N number of students should be managed using realloc() function.",
    "Write the output for this or any errors if any:\n\nvoid main()\n{\n int k=5;\n int *p=&k;\n int **m=&p;\n printf(\"%d %d %d\",k,*p,**m);\n}",
    "Considering the following programs, illustrate the required process in graphical form. Assume all necessary header files are included and all programs are syntactically correct. Illustrate memory allocation for both types of dynamic memory allocation.\n\nvoid main()\n{\n double *ptr1,*ptr2;\n ptr1=(double*)malloc(5 * sizeof(double));\n ptr2=(double*)calloc(5 , sizeof(double));\n}\nShow dummy addresses and garbage values to highlight the difference between malloc() and calloc()."
],
   "Strings": [
    "Consider the given array containing N sentences declared in the main function.\n[30 minutes, 15 Points]\nchar *txt[] = {\"this sentence contains two\", \"one is so easy\", \"what is two\", \"this cannot be three\", \"why is this not three\", \"no numbers here\"};\nWrite a program that contains a function SaveInOrder(). This function should receive the sentences contained in txt[] using appropriate parameters and then save it to a local 2D char array such that the sentences containing 'one' be stored first, followed by the sentences containing 'two', then sentences containing 'three'. The sentences containing neither of 'one', 'two' and 'three' must be stored at the end.",
    "Write an ethical paragraph corrector program which accepts two to three lines of text as input. After tokenizing the text, the program checks for a list of unethical words and replaces them with some ethical words. For this purpose the program tokenizes, compares words and modifies the input string into an output string by replacing the words: stupid, ugly, pathetic, Alas etc. An example is shown to demonstrate.",
    "Write a program to check whether a substring is present in a string or not without using library function. For this you have to implement a function named myStrStr(), this function will return 1 if substring is present in the string and return 0 if substring is not present in the string.",
    "Morse code is an encoding scheme used in telecommunication to transmit text messages from one point to the other. The encoding scheme uses combinations of dots and dashes to represent alphabetic characters. We consider a fixed-length code: each letter is represented by 5 symbols, as shown in the code table below.\nA .---.  B -...-  C -.--.  D ---..  E .-.-.  F ..--.  G ----.  H ....-  I ..---  J .----  K --.--  L .--.  M ---.-  N --...  O -----  P -.---  Q -..--  R .-...  S ...--  T -....  U ..-..  V ...-.  W --.-.  X -..-.  Y -.-.-  Z --..-\nThe code for space is ......\nWrite a C++ function that takes in a message in the form of fixed-length Morse code and converts it to English text. You need to decide the input parameters of the function.\nSample example:\nInput message: -........-..---...--.......---...--.....---.-.-.-....--...--.---.----..-.-.\nOutput: THIS IS MESSAGE.",
    "Complete a function removeWordFromString that removes all occurrences of a given word from a string."
  ],
  "File Handling": [
    "Create three text files named as Department.txt, Personal.txt and Combine.txt. Personal file contains ID and Name, Department file contains ID and Salary. Write a function which takes input as record IDs and gets the detail from both personal and department file and then adds this entry into combine file (ID, Name, Salary).",
    "Assume that the 100 academic journals records are stored in a txt file (data.txt) as shown:\n[Marks 10*2=20, 25 minutes]\nID Title Journal Issue Year startPage endPage Author\n1 Cuckoo Hashing JAIg 51 2004 121 133 Robert Tarjan\n2 Deterministic Dictionaries JAIg 41 2001 69 85 Robert Lafore\n...\n100 What Godel missed SICO 51 2008 1 5 Paul Bailey\nHint: struct Article {int ID; char Title[30]; char Journal[50];….};\nNote: “No global variables allowed. Use appropriate data types, return types and function arguments if not explicitly mentioned.”\na. Write a function named “Check_Author(…)”. This function searches the data for all the articles authored by “Robert Tarjan” and changes the author to “Robert Lafore”. If no such articles exist the function must display “Not Found.”",
    "Write a program in C to replace a specific line with another text in a file. Your program must read the file name to open, the new text to replace and the line no. Finally display the content of the updated file.\n[30 minutes, 15 Points]\nAssume that the content of the file test.txt is:\ntest line 1\ntest line 2\ntest line 3\ntest line 4\nInput the file name to be opened: test.txt\nInput the content of the new line: line has been replaced\nInput the line no you want to replace: 2\nExpected Output:\ntest line 1\nline has been replaced\ntest line 3\ntest line 4",
    "Suppose a file contains a multiple line text. Write a program to replace first letter of every word with caps in a same file.\nHint: Use fseek() function to position your pointer before over writing the letter in caps.\nSample Input/Output:\nMyFile.txt (Input)\ndon't be stressed\ndo your best\nforget the rest\nMyFile.txt (Output)\nDon't Be Stressed\nDo Your Best\nForget The Rest",
    "Considering the output given, complete the following code snippets.\nOutput:\npart: a) Enter 'exit' as First Name to stop reading user input.\nFirst Name: Ali\nLast Name: Iqbal\nRoll Number: 101\nPercentage: 90.50\nFirst Name: Naima\nLast Name: Ali\nRoll Number: 102\nPercentage: 95.50\nFirst Name: exit"
  ],
"Structures": [
  "Write a C program to work with a 3D coordinate system. The program should include:\n\n(i) Define a struct named Point3D to represent a point in 3D space with three floating-point members: x, y, and z.\n(ii) Define a struct named Cuboid to represent a cuboid in 3D space. This structure should contain:\n   - A Point3D for the back-bottom-left corner of the cuboid\n   - Three float values representing the length, width, and height of the cuboid\n\nImplement the following functions:\n(iii) float distanceBetweenPoints(Point3D p1, Point3D p2): Calculates Euclidean distance\n(iv) float cuboidVolume(Cuboid c): Calculates volume of cuboid\n(v) int isPointInsideCuboid(Point3D p, Cuboid c): Checks if point is inside cuboid.",
  " Write a program which stores information about a date in a structure containing three members i.e. day, month and year. Using bit fields the day number should get stored in first 5 bits of day, the month number in 4 bits of month and year in 12 bits of year. Write a program to read date of joining of 10 employees and display them in ascending order of year.",
  "Develop a system for a queue management for an exhibition ticketing service for maximum of 50 people. Each person in queue has a ticket number and name (Hint: Use Structures). Write four functions:\n   a) Insert new person in queue\n   b) Remove a person from queue\n   c) Select person by name using pointer to structures\n   d) Use function pointers to call above functions.",
  "Illustrate memory allocation for the following structure:\n\nstruct day {\n    int date;\n    char month[10];\n    int year;\n};\n\nstruct student {\n    int id1, id2;\n    char a;\n    float p;\n    struct day birthday;\n} student1;\n\nAssume starting address as 1020 and show the memory layout with offsets."
],
  "Recursion": [
    "Write a C program that calculates the number of 1s in the entire 2D Array of MxN size using recursion. You will be rewarded ZERO marks if you use loops by any means in the program.\nInput:\n1 0 0\n0 1 1\n1 0 1\n\nOutput: Count = 5",
    "Draw the recursive stack of the following function, if we call fibonacci(3) with n = 3.",
    "Write the output for this:\n#include <stdio.h>\nint mysteryRec(int a, int b) {\n if (b == 1)\n  return a;\n else\n  return a + mysteryRec(a, b - 1);\n}\nint main(void) {\n printf(\"The result is %u\\n\", mysteryRec(4, 5));\n return 0;\n}"
  ],
   "Bitwise": [
    "Write a program, which stores information about a date in a structure containing three members i.e. day, month and year. Using bit fields, the day number should get stored in first 5 bits of day, the month number in 4 bits of month and year in 12 bits of year. Write a program to read date of joining of 10 employees and display them in ascending order of year.",
    "Write the output for this:\n#include <stdio.h>\nint mystery(int bits ) {\n int i, total = 0;\n int mask = 1 << 31;\n for (i = 1; i <= 32; ++i, bits <<= 1) {\n if ((bits & mask) == mask)\n ++total;\n }\n return !(total % 2) ? 1 : 0;\n}\nint main(void) {\n printf(\"Result is %d\\n\", mystery(53));\n printf(\"Result is %d\\n\", mystery(8));\n printf(\"Result is %d\\n\", mystery(18));\n return 0;\n}",
    "Implement a function that counts the number of set bits (1s) in a 32-bit integer using bitwise operations only (no loops, no library functions).",
    "Implement a simple bitwise encryption algorithm that:\n- Takes a character array (string) as input\n- For each character, performs the following operations:\n  • Swaps the upper and lower nibbles (4-bit groups)\n  • XORs the result with a key byte 0x3C\n  • Rotates the bits left by 2 positions."
  ]
}

